---
title: DefinitionBindingMapIterator
classe: Autodesk.Revit.DB.DefinitionBindingMapIterator
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# DefinitionBindingMapIterator

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Object Current { get; }` | `definitionBindingMapIterator.Current` | Object |
| `Definition Key { get; }` | `definitionBindingMapIterator.Key` | Definition |
| `Boolean MoveNext()` | `definitionBindingMapIterator.MoveNext()` | Boolean |
| `Void Reset()` | `definitionBindingMapIterator.Reset()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```